In [1]:
import pandas as pd

In [2]:
sales = pd.DataFrame( {'weekday': ['Sun', 'Sun', 'Mon', 'Mon'], 'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],'bread': [139, 237, 326, 456], 'butter': [20, 45, 70, 98] })

In [3]:
sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

### boolean filter and count

In [4]:
sales.loc[sales["weekday"] == "Sun"].count

<bound method DataFrame.count of   weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45>

### using the groupby method from pandas

In [5]:
sales.groupby("weekday").count()

         city  bread  butter
weekday
Mon         2      2       2
Sun         2      2       2

#### groupby and sum

In [6]:
sales.groupby("weekday")[["bread"]].sum()

         bread
weekday
Mon        782
Sun        376

#### groupby and sum: multiple columns

In [7]:
sales.groupby("weekday")[["bread", "butter"]].sum()

         bread  butter
weekday
Mon        782     168
Sun        376      65

#### groupby and mean: multi-level index

In [8]:
sales.groupby(["city", "weekday"]).mean()

                bread  butter
city   weekday
Austin Mon        326      70
       Sun        139      20
Dallas Mon        456      98
       Sun        237      45

In [9]:
customers = pd.Series(['Dave','Alice','Bob','Alice'])

In [10]:
sales.groupby(customers)["bread"].sum()

Alice    693
Bob      326
Dave     139
Name: bread, dtype: int64

### categorical data

In [11]:
sales["weekday"].unique()

array(['Sun', 'Mon'], dtype=object)

In [12]:
sales["weekday"] = sales["weekday"].astype("category")

In [13]:
sales["weekday"]

0    Sun
1    Sun
2    Mon
3    Mon
Name: weekday, dtype: category
Categories (2, object): [Mon, Sun]

## Grouping by multiple columns
In this exercise, you will return to working with the Titanic dataset from Chapter 1 and use .groupby() to analyze the distribution of passengers who boarded the Titanic.

The 'pclass' column identifies which class of ticket was purchased by the passenger and the 'embarked' column indicates at which of the three ports the passenger boarded the Titanic. 'S' stands for Southampton, England, 'C' for Cherbourg, France and 'Q' for Queenstown, Ireland.

Your job is to first group by the 'pclass' column and count the number of rows in each class using the 'survived' column. You will then group by the 'embarked' and 'pclass' columns and count the number of passengers.

The DataFrame has been pre-loaded as titanic.

- Group by the 'pclass' column and save the result as by_class.
- Aggregate the 'survived' column of by_class using .count(). Save the result as count_by_class.
- Print count_by_class. This has been done for you.
- Group titanic by the 'embarked' and 'pclass' columns. Save the result as by_mult.
- Aggregate the 'survived' column of by_mult using .count(). Save the result as count_mult.
- Print count_mult. This has been done for you, so hit 'Submit Answer' to view the result.

In [14]:
titanic = pd.read_csv("titanic.csv")

In [15]:
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [17]:
# Group titanic by 'pclass'
by_class = titanic.groupby("pclass")

In [18]:
by_class

In [19]:
# Aggregate 'survived' column of by_class by count
count_by_class = by_class["survived"].count()

In [20]:
count_by_class

pclass
1    323
2    277
3    709
Name: survived, dtype: int64

In [21]:
# Group titanic by 'embarked' and 'pclass'
by_mult = titanic.groupby(["embarked","pclass"])

In [22]:
# Aggregate 'survived' column of by_mult by count
count_mult = by_mult["survived"].count()

In [23]:
# Print count_mult
print(count_mult)

embarked  pclass
C         1         141
          2          28
          3         101
Q         1           3
          2           7
          3         113
S         1         177
          2         242
          3         495
Name: survived, dtype: int64

### Grouping by another series
In this exercise, you'll use two data sets from Gapminder.org to investigate the average life expectancy (in years) at birth in 2010 for the 6 continental regions. To do this you'll read the life expectancy data per country into one pandas DataFrame and the association between country and region into another.

By setting the index of both DataFrames to the country name, you'll then use the region information to group the countries in the life expectancy DataFrame and compute the mean value for 2010.

The life expectancy CSV file is available to you in the variable life_fname and the regions filename is available in the variable regions_fname.

- Read life_fname into a DataFrame called life and set the index to 'Country'.
- Read regions_fname into a DataFrame called regions and set the index to 'Country'.
- Group life by the region column of regions and store the result in life_by_region.
- Print the mean over the 2010 column of life_by_region

In [25]:
# Read life_fname into a DataFrame: life
life_fname = "gapminder_tidy.csv"
life = pd.read_csv(life_fname, index_col='Country')

In [26]:
life

,Year,fertility,life,population,child_mortality,gdp,region
Country,,,,,,,
Afghanistan,1964,7.671,33.639,10474903.0,339.7,1182.0,South Asia
Afghanistan,1965,7.671,34.152,10697983.0,334.1,1182.0,South Asia
Afghanistan,1966,7.671,34.662,10927724.0,328.7,1168.0,South Asia
Afghanistan,1967,7.671,35.170,11163656.0,323.3,1173.0,South Asia
Afghanistan,1968,7.671,35.674,11411022.0,318.1,1187.0,South Asia
...,...,...,...,...,...,...,...
Åland,2002,NaN,81.800,26257.0,NaN,NaN,Europe & Central Asia
Åland,2003,NaN,80.630,26347.0,NaN,NaN,Europe & Central Asia
Åland,2004,NaN,79.880,26530.0,NaN,NaN,Europe & Central Asia
Åland,2005,NaN,80.000,26766.0,NaN,NaN,Europe & Central Asia
Åland,2006,NaN,80.100,26923.0,NaN,NaN,Europe & Central Asia

In [27]:
regions = life[["region"]]

In [28]:
regions

                            region
Country
Afghanistan             South Asia
Afghanistan             South Asia
Afghanistan             South Asia
Afghanistan             South Asia
Afghanistan             South Asia
...                            ...
Åland        Europe & Central Asia
Åland        Europe & Central Asia
Åland        Europe & Central Asia
Åland        Europe & Central Asia
Åland        Europe & Central Asia

[10111 rows x 1 columns]

In [29]:
del (life["region"])

In [39]:
#life

In [36]:
# Group life by regions['region']: life_by_region
life_by_region = life.groupby(regions["region"])

In [37]:
life_by_region["2010"].mean()

KeyError: 'Column not found: 2010'

## Groupby and aggregation

In [40]:
sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

In [41]:
sales.groupby('city')[['bread','butter']].max()

        bread  butter
city
Austin    326      70
Dallas    456      98

3### multiple aggregations

In [42]:
sales.groupby('city')[['bread','butter']].agg(['max','sum'])

       bread      butter
         max  sum    max  sum
city
Austin   326  465     70   90
Dallas   456  693     98  143

### custom aggregations

In [44]:
# define custom function
def data_range(series):
    return series.max() - series.min()

In [45]:
sales.groupby('weekday')[['bread', 'butter']].agg(data_range)

         bread  butter
weekday
Mon        130      28
Sun         98      25

### Custom aggregation: dictionaries

In [46]:
sales.groupby(customers)[['bread', 'butter']].agg({'bread':'sum', 'butter':data_range})

       bread  butter
Alice    693      53
Bob      326       0
Dave     139       0

## Computing multiple aggregates of multiple columns
The .agg() method can be used with a tuple or list of aggregations as input. When applying multiple aggregations on multiple columns, the aggregated DataFrame has a multi-level column index.

In this exercise, you're going to group passengers on the Titanic by 'pclass' and aggregate the 'age' and 'fare' columns by the functions 'max' and 'median'. You'll then use multi-level selection to find the oldest passenger per class and the median fare price per class.

The DataFrame has been pre-loaded as titanic.

- Group titanic by 'pclass' and save the result as by_class.
- Select the 'age' and 'fare' columns from by_class and save the result as by_class_sub.
- Aggregate by_class_sub using 'max' and 'median'. You'll have to pass 'max' and 'median' in the form of a list to .agg().
- Use .loc[] to print all of the rows and the column specification ('age','max'). This has been done for you.
- Use .loc[] to print all of the rows and the column specification ('fare','median').

In [47]:
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [48]:
# Group titanic by 'pclass': by_class
by_class = titanic.groupby("pclass")

In [49]:
# Select 'age' and 'fare'
by_class_sub = by_class[['age','fare']]

In [51]:
# Aggregate by_class_sub by 'max' and 'median': aggregated
aggregated = by_class_sub.agg(["max", "median"])

In [52]:
# Print the maximum age in each class
print(aggregated.loc[:, ('age','max')])

pclass
1    80.0
2    70.0
3    74.0
Name: (age, max), dtype: float64

In [53]:
# Print the median fare in each class
print(aggregated.loc[:, ('fare','median')])

pclass
1    60.0000
2    15.0458
3     8.0500
Name: (fare, median), dtype: float64

### Aggregating on index levels/fields
If you have a DataFrame with a multi-level row index, the individual levels can be used to perform the groupby. This allows advanced aggregation techniques to be applied along one or more levels in the index and across one or more columns.

In this exercise you'll use the full Gapminder dataset which contains yearly values of life expectancy, population, child mortality (per 1,000) and per capita gross domestic product (GDP) for every country in the world from 1964 to 2013.

Your job is to create a multi-level DataFrame of the columns 'Year', 'Region' and 'Country'. Next you'll group the DataFrame by the 'Year' and 'Region' levels. Finally, you'll apply a dictionary aggregation to compute the total population, spread of per capita GDP values and average child mortality rate.

- The Gapminder CSV file is available as 'gapminder.csv'.
- Read 'gapminder.csv' into a DataFrame with index_col=['Year','region','Country']. Sort the index.
- Group gapminder with a level of ['Year','region'] using its level parameter. Save the result as by_year_region.
- Define the function spread which returns the maximum and minimum of an input series. This has been done for you.
- Create a dictionary with 'population':'sum', 'child_mortality':'mean' and 'gdp':spread as aggregator. This has been done for you.
- Use the aggregator dictionary to aggregate by_year_region. Save the result as aggregated.
- Print the last 6 entries of aggregated. This has been done for you, so hit 'Submit Answer' to view the result.

In [3]:
gapminder = pd.read_csv("gapminder_tidy.csv", index_col=['Year','region','Country'])

In [5]:
# Read the CSV file into a DataFrame and sort the index: gapminder
gapminder = gapminder.sort_index()

In [6]:
gapminder

                                             fertility    life  population  \
Year region             Country
1964 America            Antigua and Barbuda      4.250  63.775     58653.0
                        Argentina                3.068  65.388  21966478.0
                        Aruba                    4.059  67.113     57031.0
                        Bahamas                  4.220  64.189    133709.0
                        Barbados                 4.094  62.819    234455.0
...                                                ...     ...         ...
2013 Sub-Saharan Africa Tanzania                 5.214  61.530  49153002.0
                        Togo                     4.639  56.537   6412560.0
                        Uganda                   5.867  59.209  36759274.0
                        Zambia                   5.687  58.105  14314515.0
                        Zimbabwe                 3.486  59.871  13327925.0

                                             child_mortality      gdp
Year region             Country
1964 America            Antigua and Barbuda            72.78   5008.0
                        Argentina                      57.43   8227.0
                        Aruba                            NaN   5505.0
                        Bahamas                        48.56  18160.0
                        Barbados                       64.70   5681.0
...                                                      ...      ...
2013 Sub-Saharan Africa Tanzania                       52.60   2382.0
                        Togo                           83.30   1346.0
                        Uganda                         65.10   1621.0
                        Zambia                         72.80   3800.0
                        Zimbabwe                       83.30   1773.0

[10111 rows x 5 columns]

In [16]:
# Group gapminder by 'Year' and 'region': by_year_region
#by_year_region = gapminder.groupby(level=[0,1])
by_year_region = gapminder.groupby(level=["Year","region"])

In [17]:
# Define the function to compute spread: spread
def spread(series):
    return series.max() - series.min()

In [18]:
# Create the dictionary: aggregator
aggregator = {'population':'sum', 'child_mortality':'mean', 'gdp':spread}

In [19]:
# Aggregate by_year_region using the dictionary: aggregated
aggregated = by_year_region.agg(aggregator)

In [20]:
# Print the last 6 entries of aggregated 
aggregated.tail(6)

                                   population  child_mortality       gdp
Year region
2013 America                     9.629087e+08        17.745833   49634.0
     East Asia & Pacific         2.244209e+09        22.285714  134744.0
     Europe & Central Asia       8.968788e+08         9.831875   86418.0
     Middle East & North Africa  4.030504e+08        20.221500  128676.0
     South Asia                  1.701241e+09        46.287500   11469.0
     Sub-Saharan Africa          9.205996e+08        76.944490   32035.0

### Grouping on a function of the index
Groupby operations can also be performed on transformations of the index values. In the case of a DateTimeIndex, we can extract portions of the datetime over which to group.

In this exercise you'll read in a set of sample sales data from February 2015 and assign the 'Date' column as the index. Your job is to group the sales data by the day of the week and aggregate the sum of the 'Units' column.

Is there a day of the week that is more popular for customers? To find out, you're going to use .strftime('%a') to transform the index datetime values to abbreviated days of the week.

The sales data CSV file is available to you as 'sales.csv'.

- Read 'sales.csv' into a DataFrame with index_col='Date' and parse_dates=True.
- Create a groupby object with sales.index.strftime('%a') as input and assign it to by_day.
- Aggregate the 'Units' column of by_day with the .sum() method. Save the result as units_sum.
- Print units_sum. This has been done for you, so hit 'Submit Answer' to see the result.

In [26]:
sales = pd.read_csv("sales-feb-2015.csv", index_col="Date", parse_dates=True)

In [27]:
sales

                             Company   Product  Units
Date
2015-02-02 08:30:00            Hooli  Software      3
2015-02-02 21:00:00        Mediacore  Hardware      9
2015-02-03 14:00:00          Initech  Software     13
2015-02-04 15:30:00        Streeplex  Software     13
2015-02-04 22:00:00  Acme Coporation  Hardware     14
2015-02-05 02:00:00  Acme Coporation  Software     19
2015-02-05 22:00:00            Hooli   Service     10
2015-02-07 23:00:00  Acme Coporation  Hardware      1
2015-02-09 09:00:00        Streeplex   Service     19
2015-02-09 13:00:00        Mediacore  Software      7
2015-02-11 20:00:00          Initech  Software      7
2015-02-11 23:00:00            Hooli  Software      4
2015-02-16 12:00:00            Hooli  Software     10
2015-02-19 11:00:00        Mediacore  Hardware     16
2015-02-19 16:00:00        Mediacore   Service     10
2015-02-21 05:00:00        Mediacore  Software      3
2015-02-21 20:30:00            Hooli  Hardware      3
2015-02-25 00:30:00          Initech   Service     10
2015-02-26 09:00:00        Streeplex   Service      4

In [28]:
# Create a groupby object: by_day
by_day = sales.groupby(sales.index.strftime('%a'))

In [35]:
# Create sum: units_sum
units_sum = by_day['Units'].agg(sum)

In [36]:
# Print units_sum
units_sum

Date
Mon    48
Sat     7
Thu    59
Tue    13
Wed    48
Name: Units, dtype: int64

## Groupby and transfromation

In [45]:
# https://en.wikipedia.org/wiki/Standard_score
""" In statistics, the standard score is the number of standard deviations by which the value of a raw score 
(i.e., an observed value or data point) is above or below the mean value of what is being observed or measured. 
Raw scores above the mean have positive standard scores, while those below the mean have negative standard scores."""
def zscore(series):
    return (series - series.mean()) / series.std()

In [41]:
auto = pd.read_csv("auto-mpg.csv")

In [42]:
auto.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,car_name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino

In [43]:
zscore(auto["mpg"]).head()

0   -0.705551
1   -1.089379
2   -0.705551
3   -0.961437
4   -0.833494
Name: mpg, dtype: float64

### MGP score by year

In [48]:
auto.groupby("model_year")["mpg"].transform(zscore).head()

0    0.058125
1   -0.503753
2    0.058125
3   -0.316460
4   -0.129168
Name: mpg, dtype: float64

In [54]:
def zscore_with_year_and_name(group):
    df = pd.DataFrame(
    {'mpg': zscore(group['mpg']),
    'year': group['model_year'],
    'name': group['car_name']})
    return df

In [57]:
auto.groupby('model_year').apply(zscore_with_year_and_name).head()

        mpg  year                       name
0  0.058125    70  chevrolet chevelle malibu
1 -0.503753    70          buick skylark 320
2  0.058125    70         plymouth satellite
3 -0.316460    70              amc rebel sst
4 -0.129168    70                ford torino

# The z-score is also useful to find outliers: a z-score value of +/- 3 is generally considered to be an outlier.

In [58]:
# Import zscore
from scipy.stats import zscore